STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp215cxx_ca35.h
#define OTFDEC_ICR_KEIF_Pos                    (2U)
#define OTFDEC_ICR_KEIF_Msk                    (0x1UL << OTFDEC_ICR_KEIF_Pos)                /*!< 0x00000004 */
#define OTFDEC_ICR_KEIF                        OTFDEC_ICR_KEIF_Msk                           /*!< Key Error Interrupt Flag clear bit */

/******************  Bit definition for OTFDEC_IER register  *****************/
#define OTFDEC_IER_SEIE_Pos                    (0U)
#define OTFDEC_IER_SEIE_Msk                    (0x1UL << OTFDEC_IER_SEIE_Pos)                /*!< 0x00000001 */
#define OTFDEC_IER_SEIE                        OTFDEC_IER_SEIE_Msk                           /*!< Security Error Interrupt Enable bit */

#define OTFDEC_IER_XONEIE_Pos                  (1U)
#define OTFDEC_IER_XONEIE_Msk                  (0x1UL << OTFDEC_IER_XONEIE_Pos)              /*!< 0x00000002 */
#define OTFDEC_IER_XONEIE                      OTFDEC_IER_XONEIE_Msk                         /*!< Execute-only Error Interrupt Enable bit */

#define OTFDEC_IER_KEIE_Pos                    (2U)
#define OTFDEC_IER_KEIE_Msk                    (0x1UL << OTFDEC_IER_KEIE_Pos)                /*!< 0x00000004 */
#define OTFDEC_IER_KEIE                        OTFDEC_IER_KEIE_Msk

/****************  Bit definition for OTFDEC_HWCFGR register  *****************/
#define OTFDEC_HWCFGR_CFG1_Pos                  (0U)
#define OTFDEC_HWCFGR_CFG1_Msk                  (0xFFUL << OTFDEC_HWCFGR_CFG1_Pos)                   /*!< 0x000000FF */
#define OTFDEC_HWCFGR_CFG1                      OTFDEC_HWCFGR_CFG1_Msk                              /*!< HW Generic 1 */
#define OTFDEC_HWCFGR_CFG2_Pos                  (8U)
#define OTFDEC_HWCFGR_CFG2_Msk                  (0xFFUL << OTFDEC_HWCFGR_CFG2_Pos)                   /*!< 0x0000FF00 */
#define OTFDEC_HWCFGR_CFG2                      OTFDEC_HWCFGR_CFG2_Msk                              /*!< HW Generic 2 */
#define OTFDEC_HWCFGR_CFG3_Pos                  (16U)
#define OTFDEC_HWCFGR_CFG3_Msk                  (0xFFUL << OTFDEC_HWCFGR_CFG3_Pos)                   /*!< 0x00FF0000 */
#define OTFDEC_HWCFGR_CFG3                      OTFDEC_HWCFGR_CFG3_Msk                              /*!< HW Generic 3 */
#define OTFDEC_HWCFGR_CFG4_Pos                  (24U)
#define OTFDEC_HWCFGR_CFG4_Msk                  (0xFUL << OTFDEC_HWCFGR_CFG4_Pos)                    /*!< 0x0F000000 */
#define OTFDEC_HWCFGR_CFG4                      OTFDEC_HWCFGR_CFG4_Msk                              /*!< HW Generic 4 */

/*****************  Bit definition for OTFDEC_VERR register  ******************/
#define OTFDEC_VERR_MINREV_Pos                  (0U)
#define OTFDEC_VERR_MINREV_Msk                  (0xFUL << OTFDEC_VERR_MINREV_Pos)                    /*!< 0x0000000F */
#define OTFDEC_VERR_MINREV                      OTFDEC_VERR_MINREV_Msk                              /*!< Minor revision */
#define OTFDEC_VERR_MAJREV_Pos                  (4U)
#define OTFDEC_VERR_MAJREV_Msk                  (0xFUL << OTFDEC_VERR_MAJREV_Pos)                    /*!< 0x000000F0 */
#define OTFDEC_VERR_MAJREV                      OTFDEC_VERR_MAJREV_Msk                              /*!< Major revision */

/*****************  Bit definition for OTFDEC_IPIDR register  *****************/
#define OTFDEC_IPIDR_ID_Pos                     (0U)
#define OTFDEC_IPIDR_ID_Msk                     (0xFFFFFFFFUL << OTFDEC_IPIDR_ID_Pos)                /*!< 0xFFFFFFFF */
#define OTFDEC_IPIDR_ID                         OTFDEC_IPIDR_ID_Msk                                 /*!< Identification Code */

/*****************  Bit definition for OTFDEC_SIDR register  ******************/
#define OTFDEC_SIDR_SID_Pos                     (0U)
#define OTFDEC_SIDR_SID_Msk                     (0xFFFFFFFFUL << OTFDEC_SIDR_SID_Pos)                /*!< 0xFFFFFFFF */
#define OTFDEC_SIDR_SID                         OTFDEC_SIDR_SID_Msk                                 /*!< Size Identification Code */

/******************************************************************************/
/*                                                                            */
/*                       Public Key Accelerator (PKA)                         */
/*                       refere to PKA2 v1.0 data-sheet                       */
/*                                                                            */
/******************************************************************************/
#define PKA_VERSION_V2_0              (1U)                                 /*!< i.e. MP2 uses PKA version v2.0 */

#define PKA_CR_EN_Pos              (0U)
#define PKA_CR_EN_Msk              (0x1UL << PKA_CR_EN_Pos)            /*!< 0x00000001 */
#define PKA_CR_EN                  PKA_CR_EN_Msk                        /*!< PKA enable */
#define PKA_CR_START_Pos           (1U)
#define PKA_CR_START_Msk           (0x1UL << PKA_CR_START_Pos)           /*!< 0x00000002 */
#define PKA_CR_START               PKA_CR_START_Msk                     /*!< Start the operation */
#define PKA_CR_MODE_Pos            (8U)
#define PKA_CR_MODE_Msk            (0x3FUL << PKA_CR_MODE_Pos)           /*!< 0x00003F00 */
#define PKA_CR_MODE                PKA_CR_MODE_Msk                      /*!< PKA operation code */
#define PKA_CR_MODE_0              (0x01UL << PKA_CR_MODE_Pos)              /*!< 0x00000100 */
#define PKA_CR_MODE_1              (0x02UL << PKA_CR_MODE_Pos)              /*!< 0x00000200 */
#define PKA_CR_MODE_2              (0x04UL << PKA_CR_MODE_Pos)              /*!< 0x00000400 */
#define PKA_CR_MODE_3              (0x08UL << PKA_CR_MODE_Pos)              /*!< 0x00000800 */
#define PKA_CR_MODE_4              (0x10UL << PKA_CR_MODE_Pos)              /*!< 0x00001000 */
#define PKA_CR_MODE_5              (0x20UL << PKA_CR_MODE_Pos)              /*!< 0x00002000 */
#define PKA_CR_PROCENDIE_Pos       (17U)
#define PKA_CR_PROCENDIE_Msk       (0x1UL << PKA_CR_PROCENDIE_Pos)       /*!< 0x00020000 */
#define PKA_CR_PROCENDIE           PKA_CR_PROCENDIE_Msk                 /*!< End of operation interrupt enable */
#define PKA_CR_RAMERRIE_Pos        (19U)
#define PKA_CR_RAMERRIE_Msk        (0x1UL << PKA_CR_RAMERRIE_Pos)        /*!< 0x00080000 */
#define PKA_CR_RAMERRIE            PKA_CR_RAMERRIE_Msk                  /*!< RAM error interrupt enable */
#define PKA_CR_ADDRERRIE_Pos       (20U)
#define PKA_CR_ADDRERRIE_Msk       (0x1UL << PKA_CR_ADDRERRIE_Pos)       /*!< 0x00100000 */
#define PKA_CR_ADDRERRIE           PKA_CR_ADDRERRIE_Msk                 /*!< Address error interrupt enable */
#define PKA_CR_OPERRIE_Pos         (21U)
#define PKA_CR_OPERRIE_Msk         (0x1UL << PKA_CR_OPERRIE_Pos)         /*!< 0x00200000 */
#define PKA_CR_OPERRIE             PKA_CR_OPERRIE_Msk                   /*!< Operation error interrupt enable */
#define PKA_CR_CMFIE_Pos           (22U)
#define PKA_CR_CMFIE_Msk           (0x1UL << PKA_CR_CMFIE_Pos)           /*!< 0x00400000 */
#define PKA_CR_CMFIE               PKA_CR_CMFIE_Msk                     /*!< Chaining mode flags interrupt enable */

/*****************  Bit definition for PKA_SR register  *****************/
#define PKA_SR_INITOK_Pos         (0U)
#define PKA_SR_INITOK_Msk         (0x1UL << PKA_SR_INITOK_Pos)          /*!< 0x00000001 */
#define PKA_SR_INITOK             PKA_SR_INITOK_Msk                    /*!< PKA initialization OK */
#define PKA_SR_LMF_Pos            (1U)
#define PKA_SR_LMF_Msk            (0x1UL << PKA_SR_LMF_Pos)             /*!< 0x00000002 */
#define PKA_SR_LMF                PKA_SR_LMF_Msk                       /*!< Limited mode */
#define PKA_SR_CCEN_Pos           (2U)
#define PKA_SR_CCEN_Msk           (0x1UL << PKA_SR_CCEN_Pos)            /*!< 0x00000004 */
#define PKA_SR_CCEN               PKA_SR_CCEN_Msk                      /*!< Coupling and chaining mode enable */
#define PKA_SR_RNGOKF_Pos         (8U)
#define PKA_SR_RNGOKF_Msk         (0x1UL << PKA_SR_RNGOKF_Pos)          /*!< 0x00000100 */
#define PKA_SR_RNGOKF             PKA_SR_RNGOKF_Msk                    /*!< RNG OK flag */
#define PKA_SR_DATAOKF_Pos        (9U)
#define PKA_SR_DATAOKF_Msk        (0x1UL << PKA_SR_DATAOKF_Pos)         /*!< 0x00000200 */
#define PKA_SR_DATAOKF            PKA_SR_DATAOKF_Msk                   /*!< Data OK flag */
#define PKA_SR_INCRERRF_Pos       (10U)
#define PKA_SR_INCRERRF_Msk       (0x1UL << PKA_SR_INCRERRF_Pos)        /*!< 0x00000400 */
#define PKA_SR_INCRERRF           PKA_SR_INCRERRF_Msk                  /*!< Increment error flag */
#define PKA_SR_DATAZF_Pos         (11U)
#define PKA_SR_DATAZF_Msk         (0x1UL << PKA_SR_DATAZF_Pos)          /*!< 0x00000800 */
#define PKA_SR_DATAZF             PKA_SR_DATAZF_Msk                    /*!< Data zeroed error flag */
#define PKA_SR_TRZERRF_Pos        (12U)
#define PKA_SR_TRZERRF_Msk        (0x1UL << PKA_SR_TRZERRF_Pos)         /*!< 0x00001000 */
#define PKA_SR_TRZERRF            PKA_SR_TRZERRF_Msk                   /*!< Trailing zeros error flag */
#define PKA_SR_MDERRF_Pos         (13U)
#define PKA_SR_MDERRF_Msk         (0x1UL << PKA_SR_MDERRF_Pos)          /*!< 0x00002000 */
#define PKA_SR_MDERRF             PKA_SR_MDERRF_Msk                    /*!< Mode error flag */
#define PKA_SR_RNGERRF_Pos        (14U)
#define PKA_SR_RNGERRF_Msk        (0x1UL << PKA_SR_RNGERRF_Pos)         /*!< 0x00004000 */
#define PKA_SR_RNGERRF            PKA_SR_RNGERRF_Msk                   /*!< RNG error flag */
#define PKA_SR_BUSY_Pos           (16U)
#define PKA_SR_BUSY_Msk           (0x1UL << PKA_SR_BUSY_Pos)            /*!< 0x00010000 */
#define PKA_SR_BUSY               PKA_SR_BUSY_Msk                      /*!< Busy flag */
#define PKA_SR_PROCENDF_Pos       (17U)
#define PKA_SR_PROCENDF_Msk       (0x1UL << PKA_SR_PROCENDF_Pos)        /*!< 0x00020000 */
#define PKA_SR_PROCENDF           PKA_SR_PROCENDF_Msk                  /*!< PKA end of operation flag */
#define PKA_SR_RAMERRF_Pos        (19U)
#define PKA_SR_RAMERRF_Msk        (0x1UL << PKA_SR_RAMERRF_Pos)         /*!< 0x00080000 */
#define PKA_SR_RAMERRF            PKA_SR_RAMERRF_Msk                   /*!< PKA RAM error flag */
#define PKA_SR_ADDRERRF_Pos       (20U)
#define PKA_SR_ADDRERRF_Msk       (0x1UL << PKA_SR_ADDRERRF_Pos)        /*!< 0x00100000 */
#define PKA_SR_ADDRERRF           PKA_SR_ADDRERRF_Msk                  /*!< Address error flag */
#define PKA_SR_OPERRF_Pos         (21U)
#define PKA_SR_OPERRF_Msk         (0x1UL << PKA_SR_OPERRF_Pos)          /*!< 0x00200000 */
#define PKA_SR_OPERRF             PKA_SR_OPERRF_Msk                    /*!< Operation error flag */
#define PKA_SR_CMF_Pos            (22U)
#define PKA_SR_CMF_Msk            (0x1UL << PKA_SR_CMF_Pos)             /*!< 0x00400000 */
#define PKA_SR_CMF                PKA_SR_CMF_Msk                       /*!< Chaining mode flags */

/***************  Bit definition for PKA_CLRFR register  ****************/
#define PKA_CLRFR_PROCENDFC_Pos   (17U)
#define PKA_CLRFR_PROCENDFC_Msk   (0x1UL << PKA_CLRFR_PROCENDFC_Pos)    /*!< 0x00020000 */
#define PKA_CLRFR_PROCENDFC       PKA_CLRFR_PROCENDFC_Msk              /*!< PKA end of operation flag clear */
#define PKA_CLRFR_RAMERRFC_Pos    (19U)
#define PKA_CLRFR_RAMERRFC_Msk    (0x1UL << PKA_CLRFR_RAMERRFC_Pos)     /*!< 0x00080000 */
#define PKA_CLRFR_RAMERRFC        PKA_CLRFR_RAMERRFC_Msk               /*!< PKA RAM error flag clear */
#define PKA_CLRFR_ADDRERRFC_Pos   (20U)
#define PKA_CLRFR_ADDRERRFC_Msk   (0x1UL << PKA_CLRFR_ADDRERRFC_Pos)    /*!< 0x00100000 */
#define PKA_CLRFR_ADDRERRFC       PKA_CLRFR_ADDRERRFC_Msk              /*!< Address error flag clear */
#define PKA_CLRFR_OPERRFC_Pos     (21U)
#define PKA_CLRFR_OPERRFC_Msk     (0x1UL << PKA_CLRFR_OPERRFC_Pos)      /*!< 0x00200000 */
#define PKA_CLRFR_OPERRFC         PKA_CLRFR_OPERRFC_Msk                /*!< Operation error flag clear */
#define PKA_CLRFR_CMFC_Pos        (22U)
#define PKA_CLRFR_CMFC_Msk        (0x1UL << PKA_CLRFR_CMFC_Pos)         /*!< 0x00400000 */
#define PKA_CLRFR_CMFC            PKA_CLRFR_CMFC_Msk                   /*!< Chaining mode flag clear */

