STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp215cxx_ca35.h
/*******************  Bits definition for RISC_RCFGLOCKR3 register *************/
#define RISC_RCFGLOCKR3_RLOCK96_Pos    (0U)
#define RISC_RCFGLOCKR3_RLOCK96_Msk    (0x1UL << RISC_RCFGLOCKR3_RLOCK96_Pos)      /*!< 0x00000001 */
#define RISC_RCFGLOCKR3_RLOCK96        RISC_RCFGLOCKR3_RLOCK0_Msk
#define RISC_RCFGLOCKR3_RLOCK97_Pos    (1U)
#define RISC_RCFGLOCKR3_RLOCK97_Msk    (0x1UL << RISC_RCFGLOCKR3_RLOCK97_Pos)      /*!< 0x00000002 */
#define RISC_RCFGLOCKR3_RLOCK97        RISC_RCFGLOCKR3_RLOCK97_Msk
#define RISC_RCFGLOCKR3_RLOCK98_Pos    (2U)
#define RISC_RCFGLOCKR3_RLOCK98_Msk    (0x1UL << RISC_RCFGLOCKR3_RLOCK98_Pos)      /*!< 0x00000004 */
#define RISC_RCFGLOCKR3_RLOCK98        RISC_RCFGLOCKR3_RLOCK98_Msk
#define RISC_RCFGLOCKR3_RLOCK99_Pos    (3U)
#define RISC_RCFGLOCKR3_RLOCK99_Msk    (0x1UL << RISC_RCFGLOCKR3_RLOCK99_Pos)      /*!< 0x00000008 */
#define RISC_RCFGLOCKR3_RLOCK99        RISC_RCFGLOCKR3_RLOCK99_Msk
#define RISC_RCFGLOCKR3_RLOCK100_Pos   (4U)
#define RISC_RCFGLOCKR3_RLOCK100_Msk   (0x1UL << RISC_RCFGLOCKR3_RLOCK100_Pos)     /*!< 0x00000010 */
#define RISC_RCFGLOCKR3_RLOCK100       RISC_RCFGLOCKR3_RLOCK100_Msk
#define RISC_RCFGLOCKR3_RLOCK101_Pos   (5U)
#define RISC_RCFGLOCKR3_RLOCK101_Msk   (0x1UL << RISC_RCFGLOCKR3_RLOCK101_Pos)     /*!< 0x00000020 */
#define RISC_RCFGLOCKR3_RLOCK101        RISC_RCFGLOCKR3_RLOCK101_Msk
#define RISC_RCFGLOCKR3_RLOCK102_Pos   (6U)
#define RISC_RCFGLOCKR3_RLOCK102_Msk   (0x1UL << RISC_RCFGLOCKR3_RLOCK102_Pos)     /*!< 0x00000040 */
#define RISC_RCFGLOCKR3_RLOCK102       RISC_RCFGLOCKR3_RLOCK102_Msk
#define RISC_RCFGLOCKR3_RLOCK103_Pos   (7U)
#define RISC_RCFGLOCKR3_RLOCK103_Msk   (0x1UL << RISC_RCFGLOCKR3_RLOCK103_Pos)     /*!< 0x00000080 */
#define RISC_RCFGLOCKR3_RLOCK103       RISC_RCFGLOCKR3_RLOCK103_Msk
#define RISC_RCFGLOCKR3_RLOCK104_Pos   (8U)
#define RISC_RCFGLOCKR3_RLOCK104_Msk   (0x1UL << RISC_RCFGLOCKR3_RLOCK104_Pos)     /*!< 0x00000100 */
#define RISC_RCFGLOCKR3_RLOCK104       RISC_RCFGLOCKR3_RLOCK104_Msk
#define RISC_RCFGLOCKR3_RLOCK105_Pos   (9U)
#define RISC_RCFGLOCKR3_RLOCK105_Msk   (0x1UL << RISC_RCFGLOCKR3_RLOCK105_Pos)     /*!< 0x00000200 */
#define RISC_RCFGLOCKR3_RLOCK105       RISC_RCFGLOCKR3_RLOCK105_Msk
#define RISC_RCFGLOCKR3_RLOCK106_Pos   (10U)
#define RISC_RCFGLOCKR3_RLOCK106_Msk   (0x1UL << RISC_RCFGLOCKR3_RLOCK106_Pos)     /*!< 0x00000400 */
#define RISC_RCFGLOCKR3_RLOCK106       RISC_RCFGLOCKR3_RLOCK106_Msk
#define RISC_RCFGLOCKR3_RLOCK107_Pos   (11U)
#define RISC_RCFGLOCKR3_RLOCK107_Msk   (0x1UL << RISC_RCFGLOCKR3_RLOCK107_Pos)     /*!< 0x00000800 */
#define RISC_RCFGLOCKR3_RLOCK107       RISC_RCFGLOCKR3_RLOCK107_Msk
#define RISC_RCFGLOCKR3_RLOCK108_Pos   (12U)
#define RISC_RCFGLOCKR3_RLOCK108_Msk   (0x1UL << RISC_RCFGLOCKR3_RLOCK108_Pos)     /*!< 0x00001000 */
#define RISC_RCFGLOCKR3_RLOCK108       RISC_RCFGLOCKR3_RLOCK108_Msk
#define RISC_RCFGLOCKR3_RLOCK109_Pos   (13U)
#define RISC_RCFGLOCKR3_RLOCK109_Msk   (0x1UL << RISC_RCFGLOCKR3_RLOCK109_Pos)     /*!< 0x00002000 */
#define RISC_RCFGLOCKR3_RLOCK109       RISC_RCFGLOCKR3_RLOCK109_Msk
#define RISC_RCFGLOCKR3_RLOCK110_Pos   (14U)
#define RISC_RCFGLOCKR3_RLOCK110_Msk   (0x1UL << RISC_RCFGLOCKR3_RLOCK110_Pos)     /*!< 0x00004000 */
#define RISC_RCFGLOCKR3_RLOCK110       RISC_RCFGLOCKR3_RLOCK110_Msk
#define RISC_RCFGLOCKR3_RLOCK111_Pos   (15U)
#define RISC_RCFGLOCKR3_RLOCK111_Msk   (0x1UL << RISC_RCFGLOCKR3_RLOCK111_Pos)     /*!< 0x00008000 */
#define RISC_RCFGLOCKR3_RLOCK111       RISC_RCFGLOCKR3_RLOCK111_Msk
#define RISC_RCFGLOCKR3_RLOCK112_Pos   (16U)
#define RISC_RCFGLOCKR3_RLOCK112_Msk   (0x1UL << RISC_RCFGLOCKR3_RLOCK112_Pos)     /*!< 0x00010000 */
#define RISC_RCFGLOCKR3_RLOCK112       RISC_RCFGLOCKR3_RLOCK112_Msk
#define RISC_RCFGLOCKR3_RLOCK113_Pos   (17U)
#define RISC_RCFGLOCKR3_RLOCK113_Msk   (0x1UL << RISC_RCFGLOCKR3_RLOCK113_Pos)     /*!< 0x00020000 */
#define RISC_RCFGLOCKR3_RLOCK113       RISC_RCFGLOCKR3_RLOCK113_Msk
#define RISC_RCFGLOCKR3_RLOCK114_Pos   (18U)
#define RISC_RCFGLOCKR3_RLOCK114_Msk   (0x1UL << RISC_RCFGLOCKR3_RLOCK114_Pos)     /*!< 0x00040000 */
#define RISC_RCFGLOCKR3_RLOCK114       RISC_RCFGLOCKR3_RLOCK114_Msk
#define RISC_RCFGLOCKR3_RLOCK115_Pos   (19U)
#define RISC_RCFGLOCKR3_RLOCK115_Msk   (0x1UL << RISC_RCFGLOCKR3_RLOCK115_Pos)     /*!< 0x00080000 */
#define RISC_RCFGLOCKR3_RLOCK115       RISC_RCFGLOCKR3_RLOCK115_Msk
#define RISC_RCFGLOCKR3_RLOCK116_Pos   (20U)
#define RISC_RCFGLOCKR3_RLOCK116_Msk   (0x1UL << RISC_RCFGLOCKR3_RLOCK116_Pos)     /*!< 0x00100000 */
#define RISC_RCFGLOCKR3_RLOCK116       RISC_RCFGLOCKR3_RLOCK116_Msk
#define RISC_RCFGLOCKR3_RLOCK117_Pos   (21U)
#define RISC_RCFGLOCKR3_RLOCK117_Msk   (0x1UL << RISC_RCFGLOCKR3_RLOCK117_Pos)     /*!< 0x00200000 */
#define RISC_RCFGLOCKR3_RLOCK117       RISC_RCFGLOCKR3_RLOCK117_Msk
#define RISC_RCFGLOCKR3_RLOCK118_Pos   (22U)
#define RISC_RCFGLOCKR3_RLOCK118_Msk   (0x1UL << RISC_RCFGLOCKR3_RLOCK118_Pos)     /*!< 0x00400000 */
#define RISC_RCFGLOCKR3_RLOCK118       RISC_RCFGLOCKR3_RLOCK118_Msk
#define RISC_RCFGLOCKR3_RLOCK119_Pos   (23U)
#define RISC_RCFGLOCKR3_RLOCK119_Msk   (0x1UL << RISC_RCFGLOCKR3_RLOCK119_Pos)     /*!< 0x00800000 */
#define RISC_RCFGLOCKR3_RLOCK119       RISC_RCFGLOCKR3_RLOCK119_Msk
#define RISC_RCFGLOCKR3_RLOCK120_Pos   (24U)
#define RISC_RCFGLOCKR3_RLOCK120_Msk   (0x1UL << RISC_RCFGLOCKR3_RLOCK120_Pos)     /*!< 0x01000000 */
#define RISC_RCFGLOCKR3_RLOCK120       RISC_RCFGLOCKR3_RLOCK120_Msk
#define RISC_RCFGLOCKR3_RLOCK121_Pos   (25U)
#define RISC_RCFGLOCKR3_RLOCK121_Msk   (0x1UL << RISC_RCFGLOCKR3_RLOCK121_Pos)     /*!< 0x02000000 */
#define RISC_RCFGLOCKR3_RLOCK121       RISC_RCFGLOCKR3_RLOCK121_Msk
#define RISC_RCFGLOCKR3_RLOCK122_Pos   (26U)
#define RISC_RCFGLOCKR3_RLOCK122_Msk   (0x1UL << RISC_RCFGLOCKR3_RLOCK122_Pos)     /*!< 0x04000000 */
#define RISC_RCFGLOCKR3_RLOCK122       RISC_RCFGLOCKR3_RLOCK122_Msk
#define RISC_RCFGLOCKR3_RLOCK123_Pos   (27U)
#define RISC_RCFGLOCKR3_RLOCK123_Msk   (0x1UL << RISC_RCFGLOCKR3_RLOCK123_Pos)     /*!< 0x08000000 */
#define RISC_RCFGLOCKR3_RLOCK123       RISC_RCFGLOCKR3_RLOCK123_Msk
#define RISC_RCFGLOCKR3_RLOCK124_Pos   (28U)
#define RISC_RCFGLOCKR3_RLOCK124_Msk   (0x1UL << RISC_RCFGLOCKR3_RLOCK124_Pos)     /*!< 0x10000000 */
#define RISC_RCFGLOCKR3_RLOCK124       RISC_RCFGLOCKR3_RLOCK124_Msk
#define RISC_RCFGLOCKR3_RLOCK125_Pos   (29U)
#define RISC_RCFGLOCKR3_RLOCK125_Msk   (0x1UL << RISC_RCFGLOCKR3_RLOCK125_Pos)     /*!< 0x20000000 */
#define RISC_RCFGLOCKR3_RLOCK125       RISC_RCFGLOCKR3_RLOCK125_Msk
#define RISC_RCFGLOCKR3_RLOCK126_Pos   (30U)
#define RISC_RCFGLOCKR3_RLOCK126_Msk   (0x1UL << RISC_RCFGLOCKR3_RLOCK126_Pos)     /*!< 0x40000000 */
#define RISC_RCFGLOCKR3_RLOCK126       RISC_RCFGLOCKR3_RLOCK126_Msk
#define RISC_RCFGLOCKR3_RLOCK127_Pos   (31U)
#define RISC_RCFGLOCKR3_RLOCK127_Msk   (0x1UL << RISC_RCFGLOCKR3_RLOCK127_Pos)     /*!< 0x80000000 */
#define RISC_RCFGLOCKR3_RLOCK127       RISC_RCFGLOCKR3_RLOCK127_Msk

