STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp215cxx_ca35.h
/**************  Bit definition for SAES_KEYR3 register  ***************/
#define SAES_KEYR3_KEY_Pos           (0U)
#define SAES_KEYR3_KEY_Msk           (0xFFFFFFFFUL << SAES_KEYR3_KEY_Pos)      /*!< 0xFFFFFFFF */
#define SAES_KEYR3_KEY               SAES_KEYR3_KEY_Msk                       /*!< Cryptographic key, bits [127:96] */

/**************  Bit definition for SAES_KEYR4 register  ***************/
#define SAES_KEYR4_KEY_Pos           (0U)
#define SAES_KEYR4_KEY_Msk           (0xFFFFFFFFUL << SAES_KEYR4_KEY_Pos)      /*!< 0xFFFFFFFF */
#define SAES_KEYR4_KEY               SAES_KEYR4_KEY_Msk                       /*!< Cryptographic key, bits [159:128] */

/**************  Bit definition for SAES_KEYR5 register  ***************/
#define SAES_KEYR5_KEY_Pos           (0U)
#define SAES_KEYR5_KEY_Msk           (0xFFFFFFFFUL << SAES_KEYR5_KEY_Pos)      /*!< 0xFFFFFFFF */
#define SAES_KEYR5_KEY               SAES_KEYR5_KEY_Msk                       /*!< Cryptographic key, bits [191:160] */

/**************  Bit definition for SAES_KEYR6 register  ***************/
#define SAES_KEYR6_KEY_Pos           (0U)
#define SAES_KEYR6_KEY_Msk           (0xFFFFFFFFUL << SAES_KEYR6_KEY_Pos)      /*!< 0xFFFFFFFF */
#define SAES_KEYR6_KEY               SAES_KEYR6_KEY_Msk                       /*!< Cryptographic key, bits [223:192] */

/**************  Bit definition for SAES_KEYR7 register  ***************/
#define SAES_KEYR7_KEY_Pos           (0U)
#define SAES_KEYR7_KEY_Msk           (0xFFFFFFFFUL << SAES_KEYR7_KEY_Pos)      /*!< 0xFFFFFFFF */
#define SAES_KEYR7_KEY               SAES_KEYR7_KEY_Msk                       /*!< Cryptographic key, bits [255:224] */

/***************  Bit definition for SAES_IVR0 register  ***************/
#define SAES_IVR0_IVI_Pos            (0U)
#define SAES_IVR0_IVI_Msk            (0xFFFFFFFFUL << SAES_IVR0_IVI_Pos)       /*!< 0xFFFFFFFF */
#define SAES_IVR0_IVI                SAES_IVR0_IVI_Msk                        /*!< Initialization vector input, bits [31:0] */

/***************  Bit definition for SAES_IVR1 register  ***************/
#define SAES_IVR1_IVI_Pos            (0U)
#define SAES_IVR1_IVI_Msk            (0xFFFFFFFFUL << SAES_IVR1_IVI_Pos)       /*!< 0xFFFFFFFF */
#define SAES_IVR1_IVI                SAES_IVR1_IVI_Msk                        /*!< Initialization vector input, bits [63:32] */

/***************  Bit definition for SAES_IVR2 register  ***************/
#define SAES_IVR2_IVI_Pos            (0U)
#define SAES_IVR2_IVI_Msk            (0xFFFFFFFFUL << SAES_IVR2_IVI_Pos)       /*!< 0xFFFFFFFF */
#define SAES_IVR2_IVI                SAES_IVR2_IVI_Msk                        /*!< Initialization vector input, bits [95:64] */

/***************  Bit definition for SAES_IVR3 register  ***************/
#define SAES_IVR3_IVI_Pos            (0U)
#define SAES_IVR3_IVI_Msk            (0xFFFFFFFFUL << SAES_IVR3_IVI_Pos)       /*!< 0xFFFFFFFF */
#define SAES_IVR3_IVI                SAES_IVR3_IVI_Msk                        /*!< Initialization vector input, bits [127:96] */

/***************  Bit definition for SAES_CSR0 register  ***************/
#define SAES_CSR0_CS0_Pos            (0U)
#define SAES_CSR0_CS0_Msk            (0xFFFFFFFFUL << SAES_CSR0_CS0_Pos)       /*!< 0xFFFFFFFF */
#define SAES_CSR0_CS0                SAES_CSR0_CS0_Msk                        /*!< Context swap data x */

/***************  Bit definition for SAES_CSR1 register  ***************/
#define SAES_CSR1_CS1_Pos            (0U)
#define SAES_CSR1_CS1_Msk            (0xFFFFFFFFUL << SAES_CSR1_CS1_Pos)       /*!< 0xFFFFFFFF */
#define SAES_CSR1_CS1                SAES_CSR1_CS1_Msk                        /*!< Context swap data x */

/***************  Bit definition for SAES_CSR2 register  ***************/
#define SAES_CSR2_CS2_Pos            (0U)
#define SAES_CSR2_CS2_Msk            (0xFFFFFFFFUL << SAES_CSR2_CS2_Pos)       /*!< 0xFFFFFFFF */
#define SAES_CSR2_CS2                SAES_CSR2_CS2_Msk                        /*!< Context swap data x */

/***************  Bit definition for SAES_CSR3 register  ***************/
#define SAES_CSR3_CS3_Pos            (0U)
#define SAES_CSR3_CS3_Msk            (0xFFFFFFFFUL << SAES_CSR3_CS3_Pos)       /*!< 0xFFFFFFFF */
#define SAES_CSR3_CS3                SAES_CSR3_CS3_Msk                        /*!< Context swap data x */

/***************  Bit definition for SAES_CSR4 register  ***************/
#define SAES_CSR4_CS4_Pos            (0U)
#define SAES_CSR4_CS4_Msk            (0xFFFFFFFFUL << SAES_CSR4_CS4_Pos)       /*!< 0xFFFFFFFF */
#define SAES_CSR4_CS4                SAES_CSR4_CS4_Msk                        /*!< Context swap data x */

/***************  Bit definition for SAES_CSR5 register  ***************/
#define SAES_CSR5_CS5_Pos            (0U)
#define SAES_CSR5_CS5_Msk            (0xFFFFFFFFUL << SAES_CSR5_CS5_Pos)       /*!< 0xFFFFFFFF */
#define SAES_CSR5_CS5                SAES_CSR5_CS5_Msk                        /*!< Context swap data x */

/***************  Bit definition for SAES_CSR6 register  ***************/
#define SAES_CSR6_CS6_Pos            (0U)
#define SAES_CSR6_CS6_Msk            (0xFFFFFFFFUL << SAES_CSR6_CS6_Pos)       /*!< 0xFFFFFFFF */
#define SAES_CSR6_CS6                SAES_CSR6_CS6_Msk                        /*!< Context swap data x */

/***************  Bit definition for SAES_CSR7 register  ***************/
#define SAES_CSR7_CS7_Pos            (0U)
#define SAES_CSR7_CS7_Msk            (0xFFFFFFFFUL << SAES_CSR7_CS7_Pos)       /*!< 0xFFFFFFFF */
#define SAES_CSR7_CS7                SAES_CSR7_CS7_Msk                        /*!< Context swap data x */

/***************  Bit definition for SAES_IER register  ****************/
#define SAES_IER_CCFIE_Pos           (2U)
#define SAES_IER_CCFIE_Msk           (0x1UL << SAES_IER_CCFIE_Pos)             /*!< 0x00000004 */
#define SAES_IER_CCFIE               SAES_IER_CCFIE_Msk                       /*!< Computation complete flag interrupt enable */
#define SAES_IER_RWEIE_Pos           (3U)
#define SAES_IER_RWEIE_Msk           (0x1UL << SAES_IER_RWEIE_Pos)             /*!< 0x00000008 */
#define SAES_IER_RWEIE               SAES_IER_RWEIE_Msk                       /*!< Read or write error interrupt enable */
#define SAES_IER_KEIE_Pos            (4U)
#define SAES_IER_KEIE_Msk            (0x1UL << SAES_IER_KEIE_Pos)              /*!< 0x00000010 */
#define SAES_IER_KEIE                SAES_IER_KEIE_Msk                        /*!< Key error interrupt enable */
#define SAES_IER_RNGEIE_Pos          (5U)
#define SAES_IER_RNGEIE_Msk          (0x1UL << SAES_IER_RNGEIE_Pos)            /*!< 0x00000020 */
#define SAES_IER_RNGEIE              SAES_IER_RNGEIE_Msk                      /*!< RNG error interrupt enable */

/***************  Bit definition for SAES_ISR register  ****************/
#define SAES_ISR_CCF_Pos             (2U)
#define SAES_ISR_CCF_Msk             (0x1UL << SAES_ISR_CCF_Pos)               /*!< 0x00000004 */
#define SAES_ISR_CCF                 SAES_ISR_CCF_Msk                         /*!< Computation complete flag */
#define SAES_ISR_RWEIF_Pos           (3U)
#define SAES_ISR_RWEIF_Msk           (0x1UL << SAES_ISR_RWEIF_Pos)             /*!< 0x00000008 */
#define SAES_ISR_RWEIF               SAES_ISR_RWEIF_Msk                       /*!< Read or write error interrupt flag */
#define SAES_ISR_KEIF_Pos            (4U)
#define SAES_ISR_KEIF_Msk            (0x1UL << SAES_ISR_KEIF_Pos)              /*!< 0x00000010 */
#define SAES_ISR_KEIF                SAES_ISR_KEIF_Msk                        /*!< Key error interrupt flag */
#define SAES_ISR_RNGEIF_Pos          (5U)
#define SAES_ISR_RNGEIF_Msk          (0x1UL << SAES_ISR_RNGEIF_Pos)            /*!< 0x00000020 */
#define SAES_ISR_RNGEIF              SAES_ISR_RNGEIF_Msk                      /*!< RNG error interrupt flag */

/***************  Bit definition for SAES_ICR register  ****************/
#define SAES_ICR_CCF_Pos             (2U)
#define SAES_ICR_CCF_Msk             (0x1UL << SAES_ICR_CCF_Pos)               /*!< 0x00000004 */
#define SAES_ICR_CCF                 SAES_ICR_CCF_Msk                         /*!< Computation complete flag clear */
#define SAES_ICR_RWEIF_Pos           (3U)
#define SAES_ICR_RWEIF_Msk           (0x1UL << SAES_ICR_RWEIF_Pos)             /*!< 0x00000008 */
#define SAES_ICR_RWEIF               SAES_ICR_RWEIF_Msk                       /*!< Read or write error interrupt flag clear */
#define SAES_ICR_KEIF_Pos            (4U)
#define SAES_ICR_KEIF_Msk            (0x1UL << SAES_ICR_KEIF_Pos)              /*!< 0x00000010 */
#define SAES_ICR_KEIF                SAES_ICR_KEIF_Msk                        /*!< Key error interrupt flag clear */
#define SAES_ICR_RNGEIF_Pos          (5U)
#define SAES_ICR_RNGEIF_Msk          (0x1UL << SAES_ICR_RNGEIF_Pos)            /*!< 0x00000020 */
#define SAES_ICR_RNGEIF              SAES_ICR_RNGEIF_Msk                      /*!< RNG error interrupt flag clear */

/**************  Bit definition for SAES_HWCFGR register  **************/
#define SAES_HWCFGR_CFG1_Pos         (0U)
#define SAES_HWCFGR_CFG1_Msk         (0xFUL << SAES_HWCFGR_CFG1_Pos)           /*!< 0x0000000F */
#define SAES_HWCFGR_CFG1             SAES_HWCFGR_CFG1_Msk                     /*!< HW Generic 1 */

